1yib.rust-bundle
anthropic.claude-code
bmd.stm32-for-vscode
dustypomerleau.rust-syntax
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
fill-labs.dependi
github.vscode-pull-request-github
golang.go
humao.rest-client
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
oderwat.indent-rainbow
redhat.java
redhat.vscode-yaml
rust-lang.rust-analyzer
scala-lang.scala
scalameta.metals
streetsidesoftware.code-spell-checker
tomoki1207.pdf
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
